{
  "name": "Probate 02D02-2502-ES*",
  "description": "These codes are for estates and probate type case files\n\nNavigate to the Website:\n\nGo to https://public.courts.in.gov/mycase/#/vw/Search.\nSearch for the Case:\n\nIn the search field (labeled \"Case Number\" or similar), enter\"\"02D02-2502-ES*\"\nView the Search Results:\n\nAfter clicking search, you will be taken to the search results page.\nProcess Each Result:\n\nFor every case/task that appears in the results, perform the following:\n\nClick on the Individual Result:\n\nOpen the case file by clicking on the result.\nCollect All Information on the Case Page:\n\nExtract the following details from each case file:\nCase Number: The unique identifier for the case.\nCourt: The court in which the case is filed.\nType: The type/category of the case.\nFiled Date: The date the case was filed.\nStatus: The current status of the case.\nDate of Status: The date when the current status was recorded.\nDecedent Details:\nDecedent name(s)\nDecedent address(es)\n(Note: There may be multiple decedents. Extract all listed names and addresses.)\nPersonal Representative Details:\nPersonal representative name(s)\nPersonal representative address(es)\n(Note: There may be multiple personal representatives. Extract all listed names and addresses.)\nPetitioner Details:\nPetitioner name(s)\nPetitioner address(es)\n(Note: There may be multiple petitioners. Extract all listed names and addresses.)\nAttorney Details:\nAttorney name(s)\nAttorney address(es)\nAttorney Phone number(s)\n(Note: There may be multiple attorneys. Extract all listed names and addresses.)\nDate of Death: The recorded date of death.\nFull Timeline of the Case: A complete chronological record of the case events.\nBalance Due: Any balance or fees currently due.\nExpand all dropdowns (for decedent, personal representative, petitioner, and any timeline events) to ensure all information is visible.\nCollect all the information on the page in case there is another data type that is needed at a later point.\nReturn to the Results:\n\nOnce all the required information has been gathered from the case file, click the back button to return to the search results page.\nNavigate Within the Page:\n\nScroll down to view the next task if needed.\nHandle Pagination:\n\nAfter collecting all the results on the current page, navigate to the next page.\nContinue this process until all pages have been completed.\n",
  "additional_info": "",
  "created_at": "2025-03-08T15:21:54.608429"
}